#NoEnv
SetBatchLines, -1
ListLines, Off
SendMode, Input
SetKeyDelay, -1
SetMouseDelay, -1
SetWinDelay, -1
SetControlDelay, -1
SetDefaultMouseSpeed, 0
;--- ここより上はauto hot key を早くするための記載です。
;--- AutoHotKey wiki を参考にしています。

TARGET_WORD = 電卓          ;--- 「電卓」という文字列でひっかけています
IfWinNotExist,%TARGET_WORD% ;--- 起動しているかどうか
{
ExitApp ; 起動していない場合は終了
}
WinGet, TARGET_ahk_id,, %TARGET_WORD% ;--- WinActivate用にIDを取得
WinActivate , ahk_id %TARGET_ahk_id%  ;--- ウィンドウをアクティブにする
sleep,100


;--- マウスクリックでアクティブに
MouseClick, left, 308, 422

;=========================================================
; ここでアクティブになるので計測開始のタイミングです
;=========================================================

Send,1{+}2{+}3{+}4{+}5{+}6{+}7{+}8{+}9{+}10{+}
Send,11{+}12{+}13{+}14{+}15{+}16{+}17{+}18{+}19{+}20{+}
Send,21{+}22{+}23{+}24{+}25{+}26{+}27{+}28{+}29{+}30{+}
Send,31{+}32{+}33{+}34{+}35{+}36{+}37{+}38{+}39{+}40{+}
Send,41{+}42{+}43{+}44{+}45{+}46{+}47{+}48{+}49{+}50{+}
Send,51{+}52{+}53{+}54{+}55{+}56{+}57{+}58{+}59{+}60{+}
Send,61{+}62{+}63{+}64{+}65{+}66{+}67{+}68{+}69{+}70{+}
Send,71{+}72{+}73{+}74{+}75{+}76{+}77{+}78{+}79{+}80{+}
Send,81{+}82{+}83{+}84{+}85{+}86{+}87{+}88{+}89{+}90{+}
Send,91{+}92{+}93{+}94{+}95{+}96{+}97{+}98{+}99{+}100
Send,{ENTER}


